Repository: skasiri/gift-i-card
Catalog: languages/gift-i-card-*.po
Languages: ar_sa, es_es, fa_ir, ru_ru

source: If the cron job is not running, click these buttons to troubleshoot. "Reschedule" will clear and recreate the cron job. "Check & Repair" will automatically detect and fix issues.
ar_sa: إذا لم يكن المهمة المجدولة في التشغيل، اضغط على هذه الأزرار للتشخيص. "إعادة زمنة المهمة" ستمسح وإعادة إنشاء المهمة المجدولة. "التحقق من إصلاح" ستكتشف وتصلح المشاكل تلقائياً.
es_es: Si la tarea programada no está corriendo, haz clic en estos botones para solucionar problemas. "Reagendar" borrará y recreará la tarea programada. "Comprobar y reparar" detectará y resolverá los problemas automáticamente.
fa_ir: اگر کرون جاب در حال اجرا نیست، برای عیب‌یابی روی این دکمه‌ها کلیک کنید. «زمان‌بندی مجدد» کرون جاب را پاک کرده و دوباره ایجاد می‌کند. «بررسی و تعمیر» به طور خودکار مشکلات را شناسایی و برطرف می‌کند.
ru_ru: Если крон-задача не запущена, нажмите эти кнопки для устранения неполадок. "Перенести" очистит и пересоздаст крон-задачу. "Проверить и исправить" автоматически обнаружит и устранит проблемы.

source: 📋 How It Works
ar_sa: 📋 كيف يعمل
es_es: 📋 ¿Cómo funciona?
fa_ir: 📋 چطور کار میکند
ru_ru: 📋 Как это работает

source: The product synchronization cron job runs automatically at the specified interval (recommended: 2-3 times a day).
ar_sa: مهمة مجدولة للتزامن المنتجات تعمل تلقائياً في الفاصل الزمني المحدد (الموصى به: 2-3 مرات في اليوم).
es_es: La tarea programada de sincronización de productos se ejecuta automáticamente en el intervalo especificado (recomendado: 2-3 veces al día).
fa_ir: کرون جاب همگام‌سازی محصول به طور خودکار در فاصله زمانی مشخص شده اجرا می‌شود (توصیه می‌شود: ۲ تا ۳ بار در روز).
ru_ru: Крон-задача синхронизации товаров выполняется автоматически в указанном интервале (рекомендуется: 2-3 раза в день).

source: The order update cron job runs automatically at the specified interval (recommended: every 5 minutes).
ar_sa: مهمة مجدولة لتحديث الطلب تعمل تلقائياً في الفاصل الزمني المحدد (الموصى به: كل 5 دقائق).
es_es: La tarea programada de actualización de pedidos se ejecuta automáticamente en el intervalo especificado (recomendado: cada 5 minutos).
fa_ir: کرون جاب به‌روزرسانی سفارش به طور خودکار در فاصله زمانی مشخص شده (توصیه می‌شود: هر 5 دقیقه) اجرا می‌شود.
ru_ru: Крон-задача обновления заказов выполняется автоматически в указанном интервале (рекомендуется: каждые 5 минут).

source: It finds all WooCommerce orders that have Gift-i-Card orders in "pending" or "processing" status.
ar_sa: تجد هذا الإضافة جميع طلبات وووكامرس التي تحتوي طلبات Gift-i-Card وفي حالة "في انتظار" أو "في المعالجة".
es_es: Encuentra todos los pedidos de WooCommerce que tienen pedidos de Gift-i-Card en estado "pendiente" o "en proceso".
fa_ir: این افزونه تمام سفارشات ووکامرس که دارای گیفت کارت هستند و در وضعیت "در انتظار" یا "در حال پردازش" قرار دارند را پیدا می‌کند.
ru_ru: Это находит все заказы WooCommerce, которые имеют заказы Gift-i-Card в статусе "в ожидании" или "в обработке".

source: For each active order, it calls the Gift-i-Card API to get the latest status.
ar_sa: بالنسبة لكل طلب فعال، يقوم API الخاص بـ Gift-i-Card باستدعاء للحصول على آخر حالة.
es_es: Para cada pedido activo, llama a la API de Gift-i-Card para obtener el estado más reciente.
fa_ir: برای هر سفارش فعال، API مربوط به Gift-i-Card را فراخوانی می‌کند تا آخرین وضعیت را دریافت کند.
ru_ru: Для каждого активного заказа API Gift-i-Card вызывается для получения последнего статуса.

source: If the status has changed, it updates the order and adds a note.
ar_sa: إذا تغيرت الحالة، يقوم بتحديث الطلب وإضافة ذكرية.
es_es: Si el estado ha cambiado, actualiza el pedido y añade una nota.
fa_ir: اگر وضعیت تغییر کرده باشد، سفارش را به‌روزرسانی کرده و یادداشتی اضافه می‌کند.
ru_ru: Если статус изменился, заказ обновляется и добавляется заметка.

source: If all Gift-i-Card orders in a WooCommerce order are completed, it can automatically complete the WooCommerce order (if enabled).
ar_sa: إذا تم إكمال جميع طلبات Gift-i-Card في طلب WooCommerce، يمكن أن يكمل الطلب تلقائياً (إذا كان مفعلاً).
es_es: Si todos los pedidos de Gift-i-Card en un pedido de WooCommerce se completan, puede completar automáticamente el pedido de WooCommerce (si está habilitado).
fa_ir: اگر تمام سفارش‌های Gift-i-Card در یک سفارش WooCommerce تکمیل شوند، می‌تواند به طور خودکار سفارش WooCommerce را تکمیل کند (در صورت فعال بودن).
ru_ru: Если все заказы Gift-i-Card в заказе WooCommerce завершены, заказ WooCommerce может быть автоматически завершен (если включено).

source: If any Gift-i-Card orders fail, it can automatically change the WooCommerce order status (if enabled).
ar_sa: إذا فشل أي من طلبات Gift-i-Card، يمكن أن يغير الطلب الأوروبي الأوروبي تلقائياً (إذا كان مفعلاً).
es_es: Si alguno de los pedidos de Gift-i-Card falla, puede cambiar automáticamente el estado del pedido de WooCommerce (si está habilitado).
fa_ir: اگر هر یک از سفارش‌های Gift-i-Card با شکست مواجه شود، می‌تواند به طور خودکار وضعیت سفارش WooCommerce را تغییر دهد (در صورت فعال بودن).
ru_ru: Если какие-либо заказы Gift-i-Card завершены с ошибкой, статус заказа WooCommerce может быть автоматически изменен (если включено).

source: Note:
ar_sa: ملاحظة:
es_es: Nota:
fa_ir: یادداشت:
ru_ru: Примечание:

source: These features require WordPress cron to be working properly. If you're using a real cron job, make sure to disable WordPress cron and set up a real cron job to call wp-cron.php.
ar_sa: هذه الميزات تتطلب أن يعمل cron WordPress بشكل صحيح. إذا كنت تستخدم كرون حقيقي، تأكد من إلغاء cron WordPress وإعداد كرون حقيقي لاستدعاء wp-cron.php.
es_es: Estas características requieren que el cron de WordPress funcione correctamente. Si estás usando un cron real, asegúrate de deshabilitar el cron de WordPress y configura un cron real para llamar a wp-cron.php.
fa_ir: این ویژگی‌ها برای عملکرد صحیح به کرون وردپرس نیاز دارند. اگر از کرون جاب واقعی استفاده می‌کنید، حتماً کرون وردپرس را غیرفعال کنید و یک کرون جاب واقعی برای فراخوانی wp-cron.php تنظیم کنید.
ru_ru: Эти функции требуют, чтобы WordPress cron работал корректно. Если вы используете реальную крон-задачу, убедитесь, что отключен WordPress cron и настроен реальный крон для вызова wp-cron.php.

source: Add to Email
ar_sa: إضافة إلى البريد الإلكتروني
es_es: Añadir al correo electrónico
fa_ir: افزودن به ایمیل
ru_ru: Добавить в email

source: Add redeem data to order emails
ar_sa: إضافة كود الشارج إلى رسائل البريد الإلكتروني للطلبات
es_es: Añadir datos de reembolso a los correos electrónicos de pedidos
fa_ir: افزودن کدهای شارژ به ایمیل سفارشات ووکامرس
ru_ru: Добавить данные для возврата в email заказа

source: Add to Order Details
ar_sa: إضافة إلى تفاصيل الطلب
es_es: Añadir a los detalles del pedido
fa_ir: افزودن به جزئیات سفارش
ru_ru: Добавить в детали заказа

source: Add redeem data to order details page
ar_sa: إضافة كود الشارج إلى صفحة تفاصيل الطلب لووكامرس
es_es: Añadir datos de reembolso a la página de detalles del pedido
fa_ir: افزودن کدهای شارژ به صفحه جزئیات سفارش ووکامرس
ru_ru: Добавить данные для возврата на страницу деталей заказа

source: Add to Thank You
ar_sa: إضافة إلى صفحة الشكر
es_es: Añadir a la página de agradecimiento
fa_ir: افزودن به صفحه تشکر از پرداخت
ru_ru: Добавить в страницу благодарности

source: Add redeem data to thank you page
ar_sa: إضافة كود الشارج إلى صفحة بعد الدفع لووكامرس
es_es: Añadir datos de reembolso a la página de agradecimiento
fa_ir: افزودن کدهای شارژ به صفحه بعد از پرداخت موفق ووکامرس
ru_ru: Добавить данные для возврата на страницу после оплаты

source: Enable Order Processing
ar_sa: تفعيل معالجة الطلبات
es_es: Habilitar procesamiento de pedidos
fa_ir: فعال‌سازی پردازش سفارشات
ru_ru: Включить обработку заказов

source: Enable order processing functionality
ar_sa: تفعيل وظيفة معالجة الطلبات
es_es: Habilitar la funcionalidad de procesamiento de pedidos
fa_ir: فعال‌سازی قابلیت پردازش سفارشات
ru_ru: Включить функционал обработки заказов

source: By disabling this, orders will not be processed automatically.
ar_sa: بإلغاء هذا الخيار، لن يتم معالجة الطلبات تلقائياً.
es_es: Deshabilitando esto, los pedidos no se procesarán automáticamente.
fa_ir: با غیرفعال کردن این گزینه، سفارشات بطور خودکار پردازش نخواهند شد.
ru_ru: Отключив это, заказы не будут обрабатываться автоматически.

source: 🔄 Gift-i-Card Order Processing
ar_sa: 🔄 معالجة الطلبات في Gift-i-Card
es_es: 🔄 Procesamiento de pedidos de Gift-i-Card
fa_ir: 🔄 پردازش سفارشات در گیفتی کارت
ru_ru: 🔄 Обработка заказов Gift-i-Card

source: Create Order at Status
ar_sa: إنشاء طلب في حالة
es_es: Crear pedido en estado
fa_ir: ثبت سفارش در وضعیت
ru_ru: Создать заказ в статусе

source: Status to set when creating Gift-i-Card pending order. This status will be used to create the order in the Gift-i-Card system.
ar_sa: الحالة التي سيتم إنشاؤها عند إنشاء طلب Gift-i-Card في النظام. هذه الحالة ستستخدم لإنشاء الطلب في سيستم Gift-i-Card.
es_es: Estado que se establecerá al crear un pedido pendiente de Gift-i-Card. Este estado se utilizará para crear el pedido en el sistema de Gift-i-Card.
fa_ir: وضعیتی که سفارش در انتظار در گیفتی کارت ایجاد شود. این وضعیت برای ایجاد سفارش در سیستم گیفتی کارت استفاده میشود.
ru_ru: Статус, который будет установлен при создании заказа Gift-i-Card в ожидании. Этот статус будет использоваться для создания заказа в системе Gift-i-Card.

source: Confirm Gift-i-Card Order at Status
ar_sa: تأكيد طلب في حالة
es_es: Confirmar pedido de Gift-i-Card en estado
fa_ir: تایید سفارش در وضعیت
ru_ru: Подтвердить заказ Gift-i-Card в статусе

source: Status to set when confirming Gift-i-Card order. This status will be used to confirm the order in the Gift-i-Card system. After this status, the order will be processed.
ar_sa: الحالة التي سيتم تأكيدها عند تأكيد طلب Gift-i-Card. هذه الحالة ستستخدم لتأكيد الطلب في سيستم Gift-i-Card. بعد هذه الحالة، سيتم معالجة الطلب.
es_es: Estado que se establecerá al confirmar el pedido de Gift-i-Card. Este estado se utilizará para confirmar el pedido en el sistema de Gift-i-Card. Después de este estado, el pedido se procesará.
fa_ir: وضعیتی که سفارش گیفتی کارت تایید شود. این وضعیت برای تایید سفارش در سیستم گیفتی کارت استفاده میشود. بعد از این وضعیت سفارش پردازش میشود.
ru_ru: Статус, который будет установлен при подтверждении заказа Gift-i-Card. Этот статус будет использоваться для подтверждения заказа в системе Gift-i-Card. После этого статуса заказ будет обработан.

source: Hook Priority
ar_sa: أولوية الهوك
es_es: Prioridad del gancho
fa_ir: اولویت اجرای هوک
ru_ru: Приоритет хука

source: Priority for hook execution (default: 10)
ar_sa: أولوية التنفيذ (الافتراضي: 10)
es_es: Prioridad para la ejecución del gancho (predeterminado: 10)
fa_ir: اولویت اجرای هوک (پیش‌فرض: ۱۰)
ru_ru: Приоритет выполнения хука (по умолчанию: 10)

source: ✅ Successfully Processed Orders
ar_sa: ✅ الطلبات المعالجة بنجاح
es_es: ✅ Pedidos procesados con éxito
fa_ir: ✅ سفارشات موفق
ru_ru: ✅ Заказы успешно обработаны

source: Change Order Status
ar_sa: تغيير حالة الطلب
es_es: Cambiar estado del pedido
fa_ir: تغییر وضعیت سفارش
ru_ru: Изменить статус заказа

source: None
ar_sa: لا شيء
es_es: Ninguno
fa_ir: هیچکدام
ru_ru: Нет

source: Orders with all items mapped
ar_sa: الطلبات التي تحتوي على جميع العناصر المرتبطة
es_es: Pedidos con todos los elementos asignados
fa_ir: سفارشات با تمام آیتم های مپ شده
ru_ru: Заказы со всеми связанными элементами

source: Orders with mapped items
ar_sa: الطلبات التي تحتوي على عناصر مرتبطة
es_es: Pedidos con elementos asignados
fa_ir: سفارشات صرفا دارای آیتم مپ شده
ru_ru: Заказы с связанными элементами

source: Change Order Status After Successfully Processing
ar_sa: تغيير حالة الطلب بعد التنفيذ الناجح
es_es: Cambiar estado del pedido después de un procesamiento exitoso
fa_ir: تغییر وضعیت سفارش بعد از عملیات موفق
ru_ru: Изменить статус заказа после успешной обработки

source: Change to Status
ar_sa: تغيير إلى حالة
es_es: Cambiar a estado
fa_ir: تغییر به وضعیت
ru_ru: Изменить на статус

source: Status to set when successfully processed orders
ar_sa: الحالة التي يتغير إليها الطلب الناجح
es_es: Estado que se establecerá cuando los pedidos se procesen con éxito
fa_ir: سفارش موفق به این وضعیت تغییر میکند
ru_ru: Статус, который будет установлен при успешно обработанных заказах

source: ❌ Failed Orders
ar_sa: ❌ الطلبات الناجحة
es_es: ❌ Pedidos fallidos
fa_ir: ❌ سفارشات ناموفق
ru_ru: ❌ Заказы с ошибкой

source: Change Order Status When Failed
ar_sa: تغيير حالة الطلب عند الفشل
es_es: Cambiar estado del pedido cuando falla
fa_ir: تغییر وضعیت سفارش زمانیکه ناموفق باشد
ru_ru: Изменить статус заказа, если он с ошибкой

source: Status to set when failed orders
ar_sa: الحالة التي يتغير إليها الطلب الناجح
es_es: Estado que se establecerá cuando los pedidos fallen
fa_ir: سفارش ناموفق به این وضعیت تغییر میکند
ru_ru: Статус, который будет установлен при заказах с ошибкой

source: 🚫 Cancelled Orders
ar_sa: 🚫 الطلبات الملغاة
es_es: 🚫 Pedidos cancelados
fa_ir: 🚫 سفارشات لغو شده
ru_ru: 🚫 Отмененные заказы

source: Change Order Status When Cancelled
ar_sa: تغيير حالة الطلب عند الإلغاء أو الإنقاذ
es_es: Cambiar estado del pedido cuando se cancela o expira
fa_ir: تغییر وضعیت سفارش زمانیکه لغو یا منقضی شود
ru_ru: Изменить статус заказа, если он отменен или истек срок

source: Status to set when cancelled orders
ar_sa: الحالة التي يتغير إليها الطلب الملغاة
es_es: Estado que se establecerá cuando los pedidos se cancelen
fa_ir: سفارش لغو شده به این وضعیت تغییر میکند
ru_ru: Статус, который будет установлен при отмененных заказах

source: Product Status Mapping Settings
ar_sa: إعدادات ترتيب حالة المنتجات
es_es: Configuración de asignación de estado de productos
fa_ir: تنظیمات ارتباط همگام سازی محصولات
ru_ru: Настройки синхронизации статуса товаров

source: Configure how Gift-i-Card product statuses should be synchronized with WooCommerce stock status.
ar_sa: تكوين كيفية تزامن حالة المنتجات في Gift-i-Card مع حالة مخزون وووكامرس.
es_es: Configura cómo los estados de los productos de Gift-i-Card deben sincronizarse con el estado de stock de WooCommerce.
fa_ir: نحوه همگام‌سازی وضعیت محصولات گیفتی کارت با وضعیت موجودی ووکامرس را پیکربندی کنید.
ru_ru: Настройте, как статусы товаров Gift-i-Card должны синхронизироваться со статусом наличия WooCommerce.

source: Gift-i-Card Status Mapping
ar_sa: ترتيب حالة التسليم في Gift-i-Card
es_es: Asignación de estado de Gift-i-Card
fa_ir: ارتباط وضعیت تحویل گیفتی کارت
ru_ru: Связь статуса доставки Gift-i-Card

source: Configure how each Gift-i-Card delivery status should affect WooCommerce stock status:
ar_sa: تكوين كيفية تأثير كل حالة تسليم Gift-i-Card على حالة مخزون WooCommerce:
es_es: Configura cómo cada estado de entrega de Gift-i-Card debe afectar el estado de stock de WooCommerce:
fa_ir: پیکربندی کنید که چگونه هر وضعیت تحویل Gift-i-Card باید بر وضعیت موجودی WooCommerce تأثیر بگذارد:
ru_ru: Настройте, как каждый статус доставки Gift-i-Card должен влиять на статус наличия WooCommerce:

source: Instant Delivery
ar_sa: التسليم الفوري
es_es: Entrega instantánea
fa_ir: تحویل آنی
ru_ru: Мгновенная доставка

source: No Change
ar_sa: بدون تغيير
es_es: Sin cambio
fa_ir: بدون تغییر
ru_ru: Без изменений

source: Change to In Stock
ar_sa: تغيير إلى موجود
es_es: Cambiar a en stock
fa_ir: تغییر به موجود
ru_ru: Изменить на наличие

source: Change to On Back Order
ar_sa: تغيير إلى طلب في الخلف
es_es: Cambiar a pedido de vuelta
fa_ir: تغییر به پیس خرید
ru_ru: Изменить на заказ назад

source: Change to Out of Stock
ar_sa: تغيير إلى غير موجود
es_es: Cambiar a fuera de stock
fa_ir: تغییر به ناموجود
ru_ru: Изменить на отсутствие

source: Action when gift card has instant/automatic delivery
ar_sa: العملية الزمنية عندما يكون البطاقة الهدية تسليماً فورياً/خودكاراً
es_es: Acción cuando la tarjeta de regalo tiene entrega instantánea/automática
fa_ir: اقدام زمانی که گیفت کارت تحویل فوری/خودکار دارد
ru_ru: Действие при мгновенной/автоматической доставке карты подарка

source: Manual Delivery
ar_sa: التسليم اليدوي
es_es: Entrega manual
fa_ir: تحویل دستی
ru_ru: Ручная доставка

source: Action when gift card requires operator intervention
ar_sa: العملية الزمنية عندما تتطلب البطاقة الهدية تدخل من طرف المشغل Gift-i-Card
es_es: Acción cuando la tarjeta de regalo requiere intervención del operador
fa_ir: اقدام زمانی که گیفت کارت نیاز به اقدام اپراتور گیفتی کارت دارد
ru_ru: Действие при необходимости оперативного вмешательства оператора Gift-i-Card

source: Out of Stock
ar_sa: غير موجود
es_es: Fuera de stock
fa_ir: ناموجود
ru_ru: Отсутствие

source: Action when gift card is out of stock
ar_sa: العملية الزمنية عندما تكون البطاقة الهدية غير موجودة
es_es: Acción cuando la tarjeta de regalo está fuera de stock
fa_ir: اقدام زمانی که گیفت کارت ناموجود است
ru_ru: Действие при отсутствии карты подарка

source: Deleted/Not Available
ar_sa: حذف / غير متوفر
es_es: Eliminado/No disponible
fa_ir: حذف شده / در دسترس نبودن
ru_ru: Удален/Недоступен

source: Action when gift card is deleted or not available
ar_sa: العملية الزمنية عندما تم حذف البطاقة الهدية أو غير متوفرة
es_es: Acción cuando la tarjeta de regalo se elimina o no está disponible
fa_ir: اقداام زمانی که گیفت کارت حذف شده یا در دسترس نیست
ru_ru: Действие при удалении или недоступности карты подарка

source: Stock Synchronization Settings
es_es: Configuración de sincronización de inventario
ru_ru: Настройки синхронизации наличия

source: Configure how product stock status should be synchronized from Gift-i-Card API.
es_es: Configure cómo se debe sincronizar el estado del inventario del producto desde la API de Gift-i-Card.
ru_ru: Настройте, как должен синхронизироваться статус наличия товара из API Gift-i-Card.

source: Enable Stock Sync (Default)
es_es: Habilitar sincronización de inventario (predeterminado)
ru_ru: Включить синхронизацию наличия (по умолчанию)

source: Enable automatic stock status synchronization from Gift-i-Card API by default for all products. Individual products can override this setting.
es_es: Habilite la sincronización automática del estado del inventario desde la API de Gift-i-Card de forma predeterminada para todos los productos. Los productos individuales pueden anular esta configuración.
ru_ru: Включить автоматическую синхронизацию статуса наличия из API Gift-i-Card по умолчанию для всех товаров. Отдельные товары могут переопределить эту настройку.

source: Advanced Settings
ar_sa: إعدادات في المستوى المتقدم
es_es: Configuración avanzada
fa_ir: تنظیمات پیشرفته
ru_ru: Расширенные настройки

source: Auto Sync on Product Load
ar_sa: تزامن تلقائي عند تحميل المنتج
es_es: Sincronización automática al cargar el producto
fa_ir: همگام سازی در هنگام لود محصول
ru_ru: Автоматическая синхронизация при загрузке товара

source: Automatically sync product status when product page is loaded.
ar_sa: تزامن خودك لحالة المنتج عند تحميل صفحة المنتج.
es_es: Sincroniza el estado del producto automáticamente cuando se carga la página del producto.
fa_ir: همگام‌سازی خودکار وضعیت محصول هنگام بارگذاری صفحه محصول.
ru_ru: Автоматически синхронизировать статус товара при загрузке страницы товара.

source: Choose how profit margin should be calculated: as a percentage of the variant price or as a fixed amount added to the price.
es_es: Elija cómo se debe calcular el margen de beneficio: como un porcentaje del precio de la variante o como una cantidad fija agregada al precio.

source: Default Profit Margin
es_es: Margen de beneficio predeterminado

source: Default profit margin as percentage (e.g., 10 for 10%). This will be added to the variant price from API.
es_es: Margen de beneficio predeterminado como porcentaje (p. ej., 10 para 10%). Esto se agregará al precio de la variante de la API.

source: Default profit margin as fixed amount (e.g., 5.00). This will be added to the variant price from API.
es_es: Margen de beneficio predeterminado como cantidad fija (p. ej., 5.00). Esto se agregará al precio de la variante de la API.

source: Permission denied
ar_sa: الوصول غير مصرح به
es_es: Permiso denegado
fa_ir: دسترسی غیر مجاز
ru_ru: Доступ отклонен

source: Simple Product
ar_sa: منتج بسيط
es_es: Producto simple
fa_ir: محصول ساده
ru_ru: Простой товар

source: Variable Product
ar_sa: منتج متغير
es_es: Producto variable
fa_ir: محصول متغیر
ru_ru: Переменный товар

source: Variation of: %s
ar_sa: المتغير من: %s
es_es: Variación de: %s
fa_ir: متغیر محصول: %s
ru_ru: Вариант: %s

source: Product Variation
ar_sa: المتغير من المنتج
es_es: Variación de producto
fa_ir: متغیر محصول
ru_ru: Вариант товара

source: Grouped Product
ar_sa: منتجات مجمعة
es_es: Producto agrupado
fa_ir: محصولات دسته بندی شده
ru_ru: Группированные товары

source: External Product
ar_sa: منتج خارجي
es_es: Producto externo
fa_ir: محصول خارجی
ru_ru: Внешний товар

source: Product
ar_sa: المنتج
es_es: Producto
fa_ir: محصول
ru_ru: Товар

source: Invalid parameters
ar_sa: المعلمات غير صالحة
es_es: Parámetros inválidos
fa_ir: پارامترهای نامعتبر
ru_ru: Неверные параметры

source: This mapping already exists
ar_sa: الاتصال بين المنتجات موجود بالفعل
es_es: Esta asignación ya existe
fa_ir: ارتباط محصولات از قبل وجود دارد
ru_ru: Эта связь уже существует

source: Error saving mapping
ar_sa: خطأ في حفظ الاتصال بين المنتجات
es_es: Error al guardar la asignación
fa_ir: خطا در ذخیره سازی ارتباط محصول
ru_ru: Ошибка сохранения связи

source: Mapping added successfully
ar_sa: تمت إضافة الاتصال بنجاح
es_es: Asignación agregada con éxito
fa_ir: با موفقیت مپ شد
ru_ru: Связь добавлена успешно

source: Mapping not found
ar_sa: الاتصال بين المنتجات غير موجود
es_es: Asignación no encontrada
fa_ir: ارتباط محصول یافت نشد
ru_ru: Связь не найдена

source: Mapping removed successfully
ar_sa: تم حذف الاتصال بنجاح
es_es: Asignación eliminada con éxito
fa_ir: ارتباط حذف شد
ru_ru: Связь удалена

source: Order not found
ar_sa: الطلب غير موجود
es_es: Pedido no encontrado
fa_ir: سفارش یافت نشد
ru_ru: Заказ не найден

source: Order item not found
ar_sa: آيتم الطلب غير موجود
es_es: Elemento de pedido no encontrado
fa_ir: آیتم سفارش یافت نشد
ru_ru: Элемент заказа не найден

source: GICAPI Public class not available
ar_sa: فئة GICAPI Public غير متوفرة
es_es: La clase GICAPI Public no está disponible
fa_ir: کلاس GICAPI Public در دسترس نیست
ru_ru: Класс GICAPI Public недоступен

source: GICAPI API not available
ar_sa: فئة GICAPI API غير متوفرة
es_es: La clase GICAPI API no está disponible
fa_ir: کلاس GICAPI API در دسترس نیست
ru_ru: Класс GICAPI API недоступен

source: Order processing is disabled
ar_sa: معالجة الطلبات غير مفعلة
es_es: El procesamiento de pedidos está deshabilitado
fa_ir: پردازش سفارشات غیرفعال است
ru_ru: Обработка заказов отключена

source: Failed to create order:
ar_sa: فشل إنشاء الطلب:
es_es: Error al crear el pedido:
fa_ir: خطا در ایجاد سفارش گیفتی کارت:
ru_ru: Не удалось создать заказ:

source: Failed to confirm order:
ar_sa: فشل تأكيد الطلب:
es_es: Error al confirmar el pedido:
fa_ir: خطا در تایید سفارش گیفتی کارت:
ru_ru: Не удалось подтвердить заказ:

source: Order created successfully
ar_sa: تم إنشاء الطلب بنجاح
es_es: Pedido creado con éxito
fa_ir: سفارش با موفقیت ایجاد شد
ru_ru: Заказ создан успешно

source: Order has not been processed yet
ar_sa: الطلب لم يتم معالجته بعد
es_es: El pedido aún no se ha procesado
fa_ir: سفارش هنوز ایجاد نشده است
ru_ru: Заказ еще не обработан

source: Order confirmed successfully
ar_sa: تم تأكيد الطلب بنجاح
es_es: Pedido confirmado con éxito
fa_ir: سفارش با موفقیت تایید شد
ru_ru: Заказ подтвержден успешно

source: GICAPI Order class not available
ar_sa: فئة GICAPI Order غير متوفرة
es_es: La clase GICAPI Order no está disponible
fa_ir: کلاس GICAPI Order در دسترس نیست
ru_ru: Класс GICAPI Order недоступен

source: Order status updated successfully
ar_sa: تم تحديث حالة الطلب بنجاح
es_es: Estado del pedido actualizado con éxito
fa_ir: سفارش با موفقیت بروزرسانی شد
ru_ru: Статус заказа обновлен успешно

source: No updates were made to the order status
ar_sa: لم يتم إجراء أي تحديثات على حالة الطلب
es_es: No se realizaron actualizaciones en el estado del pedido
fa_ir: تغییری در وضعیت سفارش انجام نشده است
ru_ru: Статус заказа не был изменен
