Repository: skasiri/gift-i-card
Catalog: languages/gift-i-card-*.po
Languages: ar_sa, es_es, fa_ir, ru_ru

source: Failed to update order status:
ar_sa: فشل تحديث حالة الطلب:
es_es: Error al actualizar el estado del pedido:
fa_ir: خطا در بروزرسانی وضعیت سفارش گیفتی کارت:
ru_ru: Не удалось обновить статус заказа:

source: GICAPI Product Sync class not available
ar_sa: فئة GICAPI Product غير متوفرة
es_es: La clase GICAPI Product no está disponible
fa_ir: کلاس GICAPI Product در دسترس نیست
ru_ru: Класс GICAPI Product недоступен

source: Product sync completed successfully. Total: %1$d, Successful: %2$d, Failed: %3$d
ar_sa: تم التزامن المنتج بنجاح. الكلي: %1$d، ناجح: %2$d، ناجح: %3$d
es_es: Sincronización de productos completada con éxito. Total: %1$d, Exitosa: %2$d, Fallida: %3$d
fa_ir: همگام‌سازی محصول با موفقیت انجام شد. مجموع: %1$d، موفق: %2$d، ناموفق: %3$d
ru_ru: Синхронизация товаров завершена успешно. Всего: %1$d, Успешно: %2$d, С ошибкой: %3$d

source: Unknown error occurred during sync
ar_sa: حدث خطأ غير معروف أثناء التزامن
es_es: Ocurrió un error desconocido durante la sincronización
fa_ir: در هنگام همگام سازی خطای ناشناخته رخ داد.
ru_ru: В процессе синхронизации произошла неизвестная ошибка

source: Failed to sync products:
ar_sa: فشل التزامن المنتجات:
es_es: Error al sincronizar productos:
fa_ir: خطا همگام سازی محصولات:
ru_ru: Не удалось синхронизировать товары:

source: Product not found
es_es: Producto no encontrado

source: Product price sync settings saved successfully
es_es: Configuración de sincronización de precios del producto guardada con éxito

source: Product stock sync settings saved successfully
es_es: Configuración de sincronización de inventario del producto guardada con éxito
ru_ru: Настройки синхронизации наличия товара успешно сохранены

source: Every 5 minutes
ar_sa: كل 5 دقائق
es_es: Cada 5 minutos
fa_ir: هر 5 دقیقه
ru_ru: Каждые 5 минут

source: Manual order update completed
ar_sa: تم إكمال تحديث ديناميكي للطلب
es_es: Actualización de pedido manual completada
fa_ir: بروزرسانی دستی سفارش انجام شد
ru_ru: Ручное обновление заказа завершено

source: Cron job rescheduled successfully
ar_sa: تم إعادة زمنة المهمة المجدولة بنجاح
es_es: Tarea programada reagendada con éxito
fa_ir: رویداد کرون با موفقیت زمانبندی شد
ru_ru: Крон-задача перенесена успешно

source: Cron job checked and repaired successfully
ar_sa: تم التحقق من إصلاح وتصليح المهمة المجدولة بنجاح
es_es: Tarea programada comprobada y reparada con éxito
fa_ir: رویداد کرون با موفقیت عیب یابی و ترمیم شد
ru_ru: Крон-задача проверена и исправлена успешно

source: Cron job check and repair failed
ar_sa: فشل التحقق من إصلاح وتصليح المهمة المجدولة
es_es: Error al comprobar y reparar la tarea programada
fa_ir: خطا در ترمیم رویداد کرون
ru_ru: Ошибка при проверке и исправлении крон-задачи

source: Gift Card Information
ar_sa: معلومات البطاقة الهدية
es_es: Información de la tarjeta de regalo
fa_ir: اطلاعات گیفت کارت
ru_ru: Информация о карте подарка

source: Status:
ar_sa: الحالة:
es_es: Estado:
fa_ir: وضعیت:
ru_ru: Статус:

source: Pending Order Creation
ar_sa: في انتظار إنشاء الطلب
es_es: Creación de pedido pendiente
fa_ir: در انتظار ایجاد
ru_ru: В ожидании создания заказа

source: Mapped Variant SKU:
ar_sa: معرف SKU للمنتج المرتبط:
es_es: SKU de variante asignada:
fa_ir: شناسه SKU محصول مرتبط:
ru_ru: Артикул связанного варианта:

source: Create Order Manually
ar_sa: إنشاء طلب ديناميكي
es_es: Crear pedido manualmente
fa_ir: ثبت دستی سفارش
ru_ru: Создать заказ вручную

source: Creating order...
ar_sa: يتم إنشاء الطلب...
es_es: Creando pedido...
fa_ir: در حال ثبت سفارش...
ru_ru: Создание заказа...

source: Pending
ar_sa: في انتظار التأكيد
es_es: Pendiente
fa_ir: در انتظار تایید
ru_ru: В ожидании

source: Processing
ar_sa: في المعالجة
es_es: Procesando
fa_ir: در حال انجام
ru_ru: В обработке

source: Completed
ar_sa: تم التكميل
es_es: Completado
fa_ir: تکمیل شده
ru_ru: Завершено

source: Failed
ar_sa: فشل
es_es: Fallido
fa_ir: ناموفق
ru_ru: Неудачно

source: Cancelled
ar_sa: تم الإلغاء
es_es: Cancelado
fa_ir: لغو شده
ru_ru: Отменено

source: Gift-i-Card Order ID:
ar_sa: معرف الطلب في Gift-i-Card:
es_es: ID de pedido de Gift-i-Card:
fa_ir: شماره سفارش گیفتی کارت:
ru_ru: Номер заказа Gift-i-Card:

source: Confirm Order Manually
ar_sa: تأكيد ديناميكي للطلب
es_es: Confirmar pedido manualmente
fa_ir: تایید دستی سفارش
ru_ru: Подтвердить заказ вручную

source: Confirming order...
ar_sa: يتم تأكيد الطلب...
es_es: Confirmando pedido...
fa_ir: در حال تایید سفارش...
ru_ru: Подтверждение заказа...

source: Expires At:
ar_sa: انتهاء الصلاحية عند:
es_es: Expira en:
fa_ir: انقضا در:
ru_ru: Истекает:

source: License Key
ar_sa: مفتاح الترخيص
es_es: Clave de licencia
fa_ir: کلید لایسنس
ru_ru: Ключ лицензии

source: Serial Number
ar_sa: الرقم التسلسلي
es_es: Número de serie
fa_ir: سريال
ru_ru: Серийный номер

source: Card Code
ar_sa: كود البطاقة
es_es: Código de tarjeta
fa_ir: کد کارت
ru_ru: Код карты

source: Redeem Link
ar_sa: رابط التصرف
es_es: Enlace de reembolso
fa_ir: لینک
ru_ru: Ссылка на возврат

source: Expires At
ar_sa: انتهاء الصلاحية
es_es: Expira en
fa_ir: انقضا
ru_ru: Истекает

source: Redemption Details
ar_sa: تفاصيل التصرف
es_es: Detalles de reembolso
fa_ir: اطلاعات ردیم
ru_ru: Детали возврата

source: Redeem
ar_sa: التصرف
es_es: Reembolsar
fa_ir: ردیم
ru_ru: Возврат

source: Update Status
ar_sa: تحديث الحالة
es_es: Actualizar estado
fa_ir: بروزرسانی وضعیت
ru_ru: Обновить статус

source: Updating status...
ar_sa: يتم تحديث الحالة...
es_es: Actualizando estado...
fa_ir: در حال بروزرسانی وضعیت...
ru_ru: Обновление статуса...

source: Print Information
ar_sa: طباعة المعلومات
es_es: Imprimir información
fa_ir: چاپ اطلاعات
ru_ru: Печать информации

source: Redemption Codes
ar_sa: كود التصرف
es_es: Códigos de reembolso
fa_ir: کدهای ردیم
ru_ru: Коды возврата

source: Click to Redeem
ar_sa: اضغط هنا
es_es: Haz clic para reembolsar
fa_ir: اینجا بزنید
ru_ru: Нажмите для возврата

source: Gift Card Redemption Details
ar_sa: تفاصيل التصرف في البطاقة الهدية
es_es: Detalles de reembolso de la tarjeta de regalo
fa_ir: اطلاعات ردیم گیفت کارت
ru_ru: Детали возврата карты подарка

source: Gift-i-Card order %1$s status updated from %2$s to %3$s %4$s
ar_sa: تم تحديث حالة طلب %1$s في Gift-i-Card من %2$s إلى %3$s %4$s
es_es: Estado del pedido %1$s de Gift-i-Card actualizado de %2$s a %3$s %4$s
fa_ir: وضعیت سفارش %1$s گیفتی کارت از %2$s به %3$s %4$s تغییر یافت
ru_ru: Статус заказа %1$s Gift-i-Card изменен с %2$s на %3$s %4$s

source: Order completed because all mapped Gift-i-Card items are completed
ar_sa: تم اكتمال الطلب لأن جميع عناصر بطاقة الهدايا اكتملت
es_es: Pedido completado porque todos los elementos asignados de Gift-i-Card están completos
fa_ir: سفارش به دلیل تکمیل همه آیتم های گیفتی کارت تکمیل شد
ru_ru: Заказ завершен, так как все элементы Gift-i-Card в заказе завершены

source: Order completed because all mapped Gift-i-Card items are completed (any-mapped)
ar_sa: تم اكتمال الطلب لأن جميع عناصر بطاقة الهدايا اكتملت (أي عنصر)
es_es: Pedido completado porque todos los elementos asignados de Gift-i-Card están completos (any-mapped)
fa_ir: سفارش به دلیل تکمیل همه آیتم ها های گیفتی کارت تکمیل شد (any-mapped)
ru_ru: Заказ завершен, так как все элементы Gift-i-Card в заказе завершены (any-mapped)

source: Order failed because all mapped Gift-i-Card items are failed
ar_sa: فشل الطلب لأن عنصرًا أو أكثر من عناصر بطاقة الهدايا فشل
es_es: Pedido fallido porque uno o varios elementos asignados de Gift-i-Card fallaron
fa_ir: سفارش به دلیل ناموفق بودن یک یا چند آیتم گیفتی کارت ناموفق شد
ru_ru: Заказ не удался, так как один или несколько элементов Gift-i-Card в заказе не удался

source: Order failed because at least one mapped Gift-i-Card item is failed (any-mapped)
ar_sa: فشل الطلب لأن عنصرًا أو أكثر من العناصر فشل (أي عنصر)
es_es: Pedido fallido porque uno o varios elementos asignados de Gift-i-Card fallaron (any-mapped)
fa_ir: سفارش به دلیل ناموفق بودن یک یا چند آیتم ناموفق شد (any-mapped)
ru_ru: Заказ не удался, так как один или несколько элементов Gift-i-Card в заказе не удался (any-mapped)

source: Order cancelled because all mapped Gift-i-Card items are cancelled
ar_sa: تم إلغاء الطلب لأن جميع عناصر بطاقة الهدايا أُلغيت
es_es: Pedido cancelado porque todos los elementos asignados de Gift-i-Card están cancelados
fa_ir: سفارش به دلیل لغو همه آیتم های گیفتی کارت لغو شد
ru_ru: Заказ отменен, так как все элементы Gift-i-Card в заказе отменены

source: Order cancelled because all mapped Gift-i-Card items are cancelled (any-mapped)
ar_sa: تم إلغاء الطلب لأن جميع عناصر بطاقة الهدايا أُلغيت (أي عنصر)
es_es: Pedido cancelado porque todos los elementos asignados de Gift-i-Card están cancelados (any-mapped)
fa_ir: سفارش به دلیل لغو همه آیتم های گیفتی کارت لغو شد
ru_ru: Заказ отменен, так как все элементы Gift-i-Card в заказе отменены (any-mapped)

source: Only POST method is allowed
ar_sa: يسمح فقط بطريقة POST
es_es: Solo se permite el método POST
fa_ir: فقط متد POST قبول است
ru_ru: Разрешен только метод POST

source: Empty request body
ar_sa: جسم الطلب فارغ
es_es: Cuerpo de solicitud vacío
fa_ir: بدنه درخواست خالی
ru_ru: Тело запроса пустое

source: Invalid JSON format
ar_sa: تنسيق JSON غير صالح
es_es: Formato JSON inválido
fa_ir: فرمت JSON نامعتبر
ru_ru: Неверный формат JSON

source: Invalid data
ar_sa: بيانات غير صالحة
es_es: Datos inválidos
fa_ir: داده نامعتبر
ru_ru: Неверные данные

source: Order ID is required
ar_sa: رقم الطلب مطلوب
es_es: El ID de pedido es obligatorio
fa_ir: شماره سفارش الزامی است
ru_ru: Номер заказа обязателен

source: Invalid order ID format
ar_sa: تنسيق رقم الطلب غير صالح
es_es: Formato de ID de pedido inválido
fa_ir: فرمت شناسه سفارش نامعتبر
ru_ru: Неверный формат номера заказа

source: Webhook secret is missing
ar_sa: رمز الويب هوك مفقود
es_es: El secreto del webhook no se encuentra
fa_ir: رمز وب هوک یافت نشد
ru_ru: Секрет вебхука отсутствует

source: No WooCommerce orders found for this Gift-i-Card order
ar_sa: لم يتم العثور على طلبات ووكومرس لهذا الطلب من بطاقة الهدايا
es_es: No se encontraron pedidos de WooCommerce para este pedido de Gift-i-Card
fa_ir: سفارش ووکامرس مرتبط با این سفارش گیفتی کارت یافت نشد
ru_ru: Заказ WooCommerce, связанный с этим заказом Gift-i-Card, не найден

source: Invalid webhook secret
ar_sa: رمز الويب هوك غير صالح
es_es: Secreto de webhook inválido
fa_ir: رمز وب هوک نامعتبر
ru_ru: Неверный секрет вебхука

source: Webhook processed successfully
ar_sa: تمت معالجة الويب هوك بنجاح
es_es: Webhook procesado con éxito
fa_ir: وب هوک با موفقیت پردازش شد
ru_ru: Вебхук обработан успешно

source: Failed to create Gift-i-Card order
ar_sa: حدث خطأ أثناء إنشاء طلب بطاقة الهدايا
es_es: Error al crear el pedido de Gift-i-Card
fa_ir: خطا در ایجاد سفارش گیفتی کارت
ru_ru: Не удалось создать заказ Gift-i-Card

source: Gift-i-Card API returned empty order_id
ar_sa: لم يتم استلام رقم الطلب من بطاقة الهدايا
es_es: El ID de pedido de Gift-i-Card no se devolvió
fa_ir: شناسه سفارش از گیفتی کارت دریافت نشد
ru_ru: Номер заказа Gift-i-Card не получен

source: Gift-i-Card order created: %s
ar_sa: تم إنشاء طلب بطاقة الهدايا: %s
es_es: Pedido de Gift-i-Card creado: %s
fa_ir: سفارش گیفتی کارت ایجاد شد: %s
ru_ru: Заказ Gift-i-Card создан: %s

source: Failed to confirm Gift-i-Card order
ar_sa: حدث خطأ أثناء تأكيد طلب بطاقة الهدايا
es_es: Error al confirmar el pedido de Gift-i-Card
fa_ir: خطا در تایید سفارش گیفتی کارت
ru_ru: Не удалось подтвердить заказ Gift-i-Card

source: Gift-i-Card order confirmed: %s
ar_sa: تم تأكيد طلب بطاقة الهدايا: %s
es_es: Pedido de Gift-i-Card confirmado: %s
fa_ir: سفارش گیفتی کارت تایید شد: %s
ru_ru: Заказ Gift-i-Card подтвержден: %s

source: A plugin to integrate WooCommerce with a gift card service
ar_sa: إضافة لدمج ووكومرس مع مزود خدمة بطاقات الهدايا
es_es: Un plugin para integrar WooCommerce con un servicio de tarjeta de regalo
fa_ir: افزونه ای برای سازگاری ووکامرس با سرویس دهنده گیفت کارت
ru_ru: Плагин для интеграции WooCommerce с сервисом карт подарков

source: SKU
fa_ir: شناسه SKU
ru_ru: Артикул

source: Select which variants to include in the variable product. You can edit details for each selected variant.
ru_ru: Выберите, какие варианты включить в вариативный товар. Вы можете редактировать детали для каждого выбранного варианта.

source: No
ar_sa: لا
fa_ir: خیر
ru_ru: Нет

source: Security check failed.
fa_ir: اعتبارسنجی با خطا مواجه شد.

source: Search Categories:
fa_ir: جستجوی دسته بندی:

source: Search Categories
fa_ir: جستجوی دسته بندی

source: It finds all WooCommerce products that are mapped to Gift-i-Card variants.
ar_sa: تجد هذا الإضافة جميع منتجات وووكامرس التي ترتبط بأنواع منتجات Gift-i-Card.
fa_ir: این افزونه تمام محصولات ووکامرس را که به انواع Gift-i-Card نگاشت (مرتبط) شده‌اند، پیدا می‌کند.

source: For each mapped product, it calls the Gift-i-Card API to get the latest stock status.
ar_sa: بالنسبة لكل منتج مرتبط، يقوم API الخاص بـ Gift-i-Card باستدعاء للحصول على آخر حالة مخزون.
fa_ir: برای هر محصول نگاشت شده، API مربوط به Gift-i-Card را فراخوانی می‌کند تا آخرین وضعیت موجودی را دریافت کند.

source: It updates the WooCommerce product stock status based on the Gift-i-Card status and your configured mapping rules.
ar_sa: تحديث حالة مخزون منتج وووكامرس بناءً على حالة Gift-i-Card وقوانين الترتيب المكونة.
fa_ir: این افزونه وضعیت موجودی محصول ووکامرس را بر اساس وضعیت Gift-i-Card و قوانین نگاشت پیکربندی شده شما به‌روزرسانی می‌کند.

source: This ensures your product availability is always synchronized with Gift-i-Card inventory.
ar_sa: هذا يضمن أن متوفرة المنتجات الخاصة بك دائماً متزامنة مع مخزون Gift-i-Card.
fa_ir: این تضمین می‌کند که موجودی محصول شما همیشه با موجودی Gift-i-Card هماهنگ باشد.

source: IRT
ar_sa: تومان
fa_ir: تومان

source: Gift-i-Card
ar_sa: بطاقة الهدايا
fa_ir: گیفتی کارت

source: Saeid Kasiri
ar_sa: سعید کثیری
fa_ir: سعید کثیری
