Repository: skasiri/gift-i-card
Catalog: languages/gift-i-card-*.po
Languages: ar_sa, es_es, fa_ir, ru_ru

source: Refreshing token...
ar_sa: جارٍ تحديث الرمز...
es_es: Actualizando el token...
fa_ir: در حال نوسازی توکن...
ru_ru: Обновление токена...

source: An unknown error occurred.
ar_sa: حدث خطأ غير معروف.
es_es: Ocurrió un error desconocido.
fa_ir: خطای ناشناخته رخ داد.
ru_ru: Произошла неизвестная ошибка.

source: Error communicating with server:
ar_sa: حدث خطأ أثناء الاتصال بالخادم:
es_es: Error al comunicarse con el servidor:
fa_ir: خطا در برقراری ارتباط با سرور:
ru_ru: Ошибка при связи с сервером:

source: Search for a product...
ar_sa: البحث عن منتج...
es_es: Buscar un producto...
fa_ir: جستجوی محصول...
ru_ru: Поиск товара...

source: Please select a product
ar_sa: الرجاء اختيار منتج
es_es: Por favor, selecciona un producto
fa_ir: محصولی را انتخاب کنید
ru_ru: Пожалуйста, выберите товар

source: Error adding mapping
ar_sa: حدث خطأ أثناء إضافة الاتصال
es_es: Error al agregar asignación
fa_ir: خطا در ایجاد ارتباط
ru_ru: Ошибка при добавлении связи

source: Are you sure you want to remove this mapping?
ar_sa: هل أنت متأكد من حذف هذا الاتصال؟
es_es: ¿Estás seguro de que quieres eliminar esta asignación?
fa_ir: آیا از حذف ارتباط محصول اطمینان دارید؟
ru_ru: Вы уверены, что хотите удалить эту связь?

source: Error removing mapping
ar_sa: حدث خطأ أثناء حذف الاتصال
es_es: Error al eliminar asignación
fa_ir: خطا در حذف ارتباط
ru_ru: Ошибка при удалении связи

source: Valid product price is required
es_es: Se requiere un precio de producto válido
ru_ru: Требуется действительная цена товара

source: At least one variant must be selected
es_es: Debe seleccionarse al menos una variante
ru_ru: Необходимо выбрать хотя бы один вариант

source: Variant name is required for all selected variants
es_es: Se requiere el nombre de la variante para todas las variantes seleccionadas
ru_ru: Требуется имя варианта для всех выбранных вариантов

source: Valid variant price is required for all selected variants
es_es: Se requiere un precio válido de variante para todas las variantes seleccionadas
ru_ru: Требуется действительная цена варианта для всех выбранных вариантов

source: Loading variants...
es_es: Cargando variantes...

source: Select All
es_es: Seleccionar Todo
ru_ru: Выбрать все

source: Price:
ar_sa: السعر:
es_es: Precio:
fa_ir: مبلغ:
ru_ru: Цена:

source: e.g., VAR-001
es_es: ej., VAR-001
ru_ru: например, VAR-001

source: Updating...
ar_sa: يتم التحديث...
es_es: Actualizando...
fa_ir: در حال بروزرسانی...
ru_ru: Обновление...

source: An error occurred while updating orders.
ar_sa: حدث خطأ أثناء تحديث الطلبات.
es_es: Ocurrió un error al actualizar los pedidos.
fa_ir: خطایی در بروزرسانی وضعیت سفارشات رخ داد.
ru_ru: Произошла ошибка при обновлении заказов.

source: Update Pending/Processing Orders Now
ar_sa: تحديث الطلبات المعلقة / المعالجة حالياً
es_es: Actualizar pedidos pendientes/en proceso ahora
fa_ir: بروزرسانی سفارشات در انتظار / درحال انجام
ru_ru: Обновить заказы в ожидании / в обработке

source: Syncing...
ar_sa: يتم التزامن...
es_es: Sincronizando...
fa_ir: در حال همگام سازی...
ru_ru: Синхронизация...

source: An error occurred while syncing products.
ar_sa: حدث خطأ أثناء التزامن المنتجات.
es_es: Ocurrió un error al sincronizar los productos.
fa_ir: خطایی در همگام سازی محصولات رخ داد.
ru_ru: Произошла ошибка при синхронизации товаров.

source: Sync All Products Now
ar_sa: تزامن جميع المنتجات الآن
es_es: Sincronizar todos los productos ahora
fa_ir: هم اکنون همگام سازی کن
ru_ru: Синхронизировать все товары сейчас

source: Rescheduling...
ar_sa: يتم إعادة زمنة مهمة مجدولة...
es_es: Reagendando...
fa_ir: در حال زمانبندی مجدد...
ru_ru: Перепланирование...

source: An error occurred while rescheduling cron job.
ar_sa: حدث خطأ أثناء إعادة زمنة المهمة المجدولة.
es_es: Ocurrió un error al reagendar la tarea programada.
fa_ir: خطایی در روند زمانبندی رویداد کرون رخ داد.
ru_ru: Произошла ошибка при перепланировании крон-задачи.

source: Reschedule Cron Job
ar_sa: إعادة زمنة مهمة مجدولة
es_es: Reagendar tarea programada
fa_ir: زمانبندی مجدد کرون جاب
ru_ru: Перенести крон-задачу

source: Checking...
ar_sa: يتم التحقق...
es_es: Comprobando...
fa_ir: در حال بررسی...
ru_ru: Проверка...

source: An error occurred while checking cron job.
ar_sa: حدث خطأ أثناء التحقق من المهمة المجدولة.
es_es: Ocurrió un error al comprobar la tarea programada.
fa_ir: خطایی در روند بررسی رویدادهای کرون رخ داد.
ru_ru: Произошла ошибка при проверке крон-задачи.

source: Check & Repair Cron Job
ar_sa: التحقق من إصلاح مهمة مجدولة
es_es: Comprobar y reparar tarea programada
fa_ir: بررسی و تعمیر کرون جاب
ru_ru: Проверить и исправить крон-задачу

source: Connected
ar_sa: متصل
es_es: Conectado
fa_ir: متصل
ru_ru: Подключено

source: Balance
ar_sa: الرصيد
es_es: Saldo
fa_ir: موجودی
ru_ru: Баланс

source: Disconnected
ar_sa: غير متصل
es_es: Desconectado
fa_ir: قطع
ru_ru: Отключено

source: You do not have permission to perform this action.
ar_sa: ليس لديك إذن لتنفيذ هذا الإجراء.
es_es: No tienes permiso para realizar esta acción.
fa_ir: دسترسی لازم برای این کار را ندارید.
ru_ru: У вас нет прав для выполнения этого действия.

source: Token refreshed successfully. Please refresh the page or save the settings to see the new connection status.
ar_sa: تم تحديث الرمز بنجاح. يرجى تحديث الصفحة أو حفظ الإعدادات لرؤية حالة الاتصال الجديدة.
es_es: Token actualizado correctamente. Por favor, actualiza la página o guarda la configuración para ver el nuevo estado de conexión.
fa_ir: توکن با موفقیت نوسازی شد. لطفاً صفحه را به‌روزرسانی کنید تا وضعیت اتصال جدید را مشاهده کنید.
ru_ru: Токен успешно обновлен. Пожалуйста, обновите страницу или сохраните настройки, чтобы увидеть новый статус подключения.

source: Error refreshing token. Please check the API settings and try again.
ar_sa: حدث خطأ أثناء تحديث الرمز. يرجى التحقق من إعدادات API والمحاولة مرة أخرى.
es_es: Error al actualizar el token. Verifica la configuración de la API e inténtalo de nuevo.Error al actualizar el token. Por favor, revisa la configuración de la API e inténtalo de nuevo.
fa_ir: خطا در نوسازی توکن. لطفاً تنظیمات API را بررسی کرده و دوباره تلاش کنید.
ru_ru: Ошибка обновления токена. Проверьте настройки API и попробуйте снова.Ошибка обновления токена. Пожалуйста, проверьте настройки API и попробуйте снова.

source: Security check failed. Please try again.
ar_sa: فشل التحقق الأمني. يرجى المحاولة مرة أخرى.
es_es: La verificación de seguridad falló. Por favor, inténtalo de nuevo.
ru_ru: Проверка безопасности не пройдена. Пожалуйста, попробуйте снова.

source: Invalid product or variant ID.
ar_sa: معرف المنتج أو المتغير غير صالح.
es_es: ID de producto o variante no válido.
fa_ir: شناسه محصول یا واریانت نامعتبر است.
ru_ru: Неверный идентификатор продукта или варианта.

source: Variant mapped successfully.
ar_sa: تم ربط المتغير بنجاح.
es_es: Variante asignada correctamente.
fa_ir: واریانت با موفقیت مرتبط شد.
ru_ru: Вариант успешно связан.

source: Gift-i-Card Settings
ar_sa: إعدادات Gift-i-Card
es_es: Configuración de Gift-i-Card
fa_ir: تنظیمات گیفتی کارت
ru_ru: Настройки Gift-i-Card

source: Connection
ar_sa: الاتصال
es_es: Conexión
fa_ir: اتصال
ru_ru: Подключение

source: Orders
ar_sa: الطلبات
es_es: Pedidos
fa_ir: سفارشات
ru_ru: Заказы

source: Products
ar_sa: المنتجات
es_es: Productos
fa_ir: محصولات
ru_ru: Товары

source: Cron Jobs
ar_sa: مهام مجدولة
es_es: Tareas programadas
fa_ir: کرون جاب
ru_ru: Крон-задачи

source: Display
ar_sa: العرض
es_es: Mostrar
fa_ir: نمایش
ru_ru: Отображение

source: Error fetching categories from API
ar_sa: حدث خطأ أثناء جلب الفئات من API
es_es: Error al obtener categorías de la API
fa_ir: خطا در دریافت لیست دسته بندی ها از API
ru_ru: Ошибка получения категорий из API

source: Categories
ar_sa: الفئات
es_es: Categorías
fa_ir: دسته بندی ها
ru_ru: Категории

source: Thumbnail
ar_sa: صورة مصغرة
es_es: Miniatura
fa_ir: تصویر
ru_ru: Изображение

source: Name
ar_sa: الاسم
es_es: Nombre
fa_ir: نام
ru_ru: Название

source: Product Count
ar_sa: عدد المنتجات
es_es: Cantidad de productos
fa_ir: تعداد محصول
ru_ru: Количество товаров

source: Mapped Products
ar_sa: المنتجات المرتبطة
es_es: Productos asignados
fa_ir: محصولات مرتبط
ru_ru: Связанные товары

source: Mapped Variants
ar_sa: المتغيرات المرتبطة
es_es: Variantes asignadas
ru_ru: Связанные варианты

source: No categories found.
ar_sa: لم يتم العثور على فئات.
es_es: No se encontraron categorías.
fa_ir: دسته بندی یافت نشد.
ru_ru: Категории не найдены.

source: %s item
ar_sa: %s عنصر
es_es: %s artículo
fa_ir: %s آیتم
ru_ru: %s предмет

source: Category is not valid.
ar_sa: الفئة غير صالحة.
es_es: La categoría no es válida.
fa_ir: دسته بندی نامعتبر است.
ru_ru: Категория недействительна.

source: Error fetching products from API
ar_sa: حدث خطأ أثناء جلب المنتجات من API
es_es: Error al obtener productos de la API
fa_ir: خطا در دریافت لیست محصولات از API
ru_ru: Ошибка получения товаров из API

source: No products found for this category.
ar_sa: لم يتم العثور على منتجات لهذه الفئة.
es_es: No se encontraron productos para esta categoría.
fa_ir: هیچ محصولی برای این دسته بندی یافت نشد.
ru_ru: Для этой категории товары не найдены.

source: Unknown Category
ar_sa: فئة غير معروفة
es_es: Categoría desconocida
fa_ir: دسته بندی ناشناخته
ru_ru: Неизвестная категория

source: Image
ar_sa: صورة
es_es: Imagen
fa_ir: تصویر
ru_ru: Изображение

source: Variant Count
ar_sa: عدد المتغيرات
es_es: Cantidad de variantes
fa_ir: تعداد واریانت
ru_ru: Количество вариантов

source: Unknown Product
ar_sa: منتج غير معروف
es_es: Producto desconocido
fa_ir: محصول ناشناخته
ru_ru: Неизвестный товар

source: Error fetching variants from API
ar_sa: حدث خطأ أثناء جلب المتغيرات من API
es_es: Error al obtener variantes de la API
fa_ir: خطا در دریافت لیست واریانت از API
ru_ru: Ошибка получения вариантов из API

source: No variants found for this product.
ar_sa: لم يتم العثور على متغيرات لهذا المنتج.
es_es: No se encontraron variantes para este producto.
fa_ir: هیچ واریانتی برای این محصول یافت نشد.
ru_ru: Для этого продукта не найдено вариантов.

source: Variants
ar_sa: المتغيرات
es_es: Variantes
fa_ir: واریانت ها
ru_ru: Варианты

source: Price
ar_sa: السعر
es_es: Precio
fa_ir: قیمت
ru_ru: Цена

source: Value
ar_sa: القيمة
es_es: Valor
fa_ir: اعتبار
ru_ru: Значение

source: Stock Status
ar_sa: حالة المخزون
es_es: Estado de stock
fa_ir: وضعیت فروش
ru_ru: Статус наличия

source: Mapped WC Products
ar_sa: منتجات مرتبطة ووكامرس
es_es: Productos asignados de WooCommerce
fa_ir: محصولات مرتبط ووکامرس
ru_ru: Связанные товары WooCommerce

source: Actions
es_es: Acciones
ru_ru: Действия

source: Stock Sync
es_es: Sincronización de inventario
ru_ru: Синхронизация наличия

source: Customize price sync settings
es_es: Personalizar configuración de sincronización de precios
ru_ru: Настроить параметры синхронизации цен

source: %d product mapped
ar_sa: %d منتج داخل الاتصال
es_es: %d producto asignado
fa_ir: %d محصول در ارتباط
ru_ru: %d товар связан

source: Add Mapping
ar_sa: إضافة الاتصال
es_es: Agregar asignación
fa_ir: افزودن ارتباط
ru_ru: Добавить связь

source: Map Gift-i-Card Variant to WooCommerce Product
ar_sa: تحديد الاتصال بين منتج وووكامرس ومتغير Gift-i-Card
es_es: Asignar variante de Gift-i-Card a producto de WooCommerce
fa_ir: برقراری ارتباط بین محصول ووکامرس و واریانت گیفتی کارت
ru_ru: Связать вариант Gift-i-Card с товаром WooCommerce

source: Cancel
ar_sa: إلغاء
es_es: Cancelar
fa_ir: انصراف
ru_ru: Отмена

source: Create Simple Product from Gift-i-Card Variant
es_es: Crear Producto Simple desde Variante de Gift-i-Card
ru_ru: Создать простой товар из варианта Gift-i-Card

source: e.g., MY-SKU-001
es_es: ej., MY-SKU-001
ru_ru: например, MY-SKU-001

source: Optional unique identifier for the product.
es_es: Identificador único opcional para el producto.
ru_ru: Необязательный уникальный идентификатор для товара.

source: Regular Price
es_es: Precio Regular
ru_ru: Обычная цена

source: Draft
es_es: Borrador
ru_ru: Черновик

source: Published
es_es: Publicado
ru_ru: Опубликовано

source: Profit Margin Type
es_es: Tipo de margen de beneficio
ru_ru: Тип наценки

source: Percentage (%)
es_es: Porcentaje (%)
ru_ru: Процент (%)

source: Fixed Amount
es_es: Cantidad fija
ru_ru: Фиксированная сумма

source: Profit Margin
es_es: Margen de beneficio
ru_ru: Прибыль

source: Profit margin to add to variant price from API.
es_es: Margen de beneficio para agregar al precio de la variante de la API.
ru_ru: Прибыль для добавления к цене варианта из API.

source: Create Variable Product from Gift-i-Card Variants
es_es: Crear Producto Variable desde Variantes de Gift-i-Card
ru_ru: Создать вариативный товар из вариантов Gift-i-Card

source: e.g., MY-VARIABLE-PRODUCT
es_es: ej., MI-PRODUCTO-VARIABLE
ru_ru: например, МОЙ-ВЫРИАНТНЫЙ-ТОВАР

source: Optional unique identifier for the variable product.
es_es: Identificador único opcional para el producto variable.
ru_ru: Необязательный уникальный идентификатор для вариативного товара.

source: Attribute Name
es_es: Nombre del Atributo
ru_ru: Название атрибута

source: e.g., Amount, Value, Size
es_es: ej., Monto, Valor, Tamaño
ru_ru: например: Сумма, Значение, Размер

source: Name of the attribute that will be used for variations (e.g., Amount, Value, Size).
es_es: Nombre del atributo que se utilizará para las variaciones (p. ej., Importe, Valor, Tamaño).
ru_ru: Название атрибута, который будет использоваться для вариаций (например: Сумма, Значение, Размер).

source: These mapping fields are automatically set and cannot be changed.
es_es: Estos campos de asignación se establecen automáticamente y no se pueden cambiar.
ru_ru: Эти поля сопоставления устанавливаются автоматически и не могут быть изменены.

source: Profit margin to add to variant prices from API.
es_es: Margen de beneficio para agregar a los precios de las variantes de la API.

source: Customize Product Price Sync
es_es: Personalizar sincronización de precios del producto

source: Enable price synchronization for this product.
es_es: Habilitar sincronización de precios para este producto.

source: Save
es_es: Guardar

source: Base URL
ar_sa: عنوان URL الاتصال
es_es: URL base
fa_ir: آدرس اتصال
ru_ru: Базовый URL

source: The base URL of the gift-i-card service API
ar_sa: عنوان URL خدمة API Gift-i-Card
es_es: La URL base del servicio API de Gift-i-Card
fa_ir: آدرس اتصال به وب سرویس گیفتی کارت
ru_ru: Базовый URL API сервиса Gift-i-Card

source: Consumer Key
ar_sa: مفتاح المستهلك
es_es: Clave del consumidor
fa_ir: کلید مصرف کننده
ru_ru: Ключ клиента

source: The consumer key for API authentication
ar_sa: مفتاح المستهلك للتحقق من صحة وب سرويس API
es_es: La clave del consumidor para la autenticación de API
fa_ir: کلید مصرف کننده برای اعتبارسنجی وب سرویس
ru_ru: Ключ клиента для аутентификации API

source: Consumer Secret
ar_sa: سر المستهلك
es_es: Secreto del consumidor
fa_ir: رمز مصرف کننده
ru_ru: Секрет клиента

source: The consumer secret for API authentication
ar_sa: سر المستهلك للتحقق من صحة وب سرويس API
es_es: El secreto del consumidor para la autenticación de API
fa_ir: رمز مصرف کننده برای اعتبارسنجی وب سرویس
ru_ru: Секрет клиента для аутентификации API

source: Refresh Token
ar_sa: تحديث الرمز
es_es: Actualizar token
fa_ir: نوسازی توکن
ru_ru: Обновить токен

source: Get New Token
ar_sa: الحصول على رمز جديد
es_es: Obtener nuevo token
fa_ir: دریافت توکن جدید
ru_ru: Получить новый токен

source: Click this button to discard the current token and get a new one from the API.
ar_sa: اضغط على هذا الزر لإلغاء الرمز الحالي والحصول على واحد جديد من API.
es_es: Haz clic en este botón para descartar el token actual y obtener uno nuevo de la API.
fa_ir: برای ابطال توکن فعلی و دریافت توکن جدید این دکمه را بزنید.
ru_ru: Нажмите эту кнопку, чтобы сбросить текущий токен и получить новый из API.

source: 🔄 Product Synchronization Cron Job
ar_sa: 🔄 مهمة مجدولة للتزامن المنتجات
es_es: 🔄 Tarea programada de sincronización de productos
fa_ir: 🔄 زمانبندی همگام سازی محصولات
ru_ru: 🔄 Крон-задача синхронизации товаров

source: Product Sync Cron Job
ar_sa: مهمة مجدولة للتزامن المنتجات
es_es: Tarea programada de sincronización de productos
fa_ir: زمانبندی همگام سازی محصولات
ru_ru: Крон-задача синхронизации товаров

source: Enable Cron Job for Product Status Synchronization
ar_sa: تفعيل مهمة مجدولة للتزامن حالة المنتجات
es_es: Habilitar tarea programada para sincronización de estado de producto
fa_ir: همگام سازی محصولات از طریق زمانبندی انجام شود
ru_ru: Включить крон-задачу для синхронизации статуса товаров

source: Automatically sync product statuses from Gift-i-Card to WooCommerce at regular intervals. This ensures your product stock statuses are always up to date.
ar_sa: تزامن خودك لحالة المنتجات من Gift-i-Card بووكامرس في فواصل زمنية منتظمة. هذا يضمن أن حالة المخزون لمنتجاتك دائماً حديثة.
es_es: Sincroniza el estado de los productos de Gift-i-Card con WooCommerce en intervalos regulares. Esto garantiza que el estado de stock de tus productos siempre esté actualizado.
fa_ir: همگام‌سازی خودکار وضعیت محصولات از Gift-i-Card با WooCommerce در فواصل زمانی منظم. این تضمین می‌کند که وضعیت موجودی محصولات شما همیشه به‌روز باشد.
ru_ru: Автоматически синхронизировать статусы товаров из Gift-i-Card с WooCommerce через регулярные интервалы. Это гарантирует, что статусы наличия ваших товаров всегда актуальны.

source: Product Sync Interval
ar_sa: فاصل التزامن
es_es: Intervalo de sincronización de productos
fa_ir: دوره زمانی
ru_ru: Интервал синхронизации товаров

source: How often should the system synchronize product status? Recommended: 2-3 times a day.
ar_sa: كيف يجب أن يتزامن جهازك حالة المنتجات؟ الموصى به: مرتين أو ثلاث مرات في اليوم.
es_es: ¿Con qué frecuencia debería sincronizar el sistema el estado de los productos? Recomendado: 2-3 veces al día.
fa_ir: سیستم هر چند وقت یکبار باید وضعیت محصولات را همگام‌سازی کند. توصیه می‌شود: دو تا ۳ بار در روز.
ru_ru: Как часто система должна синхронизировать статусы товаров? Рекомендуется: 2-3 раза в день.

source: Manual Product Sync
ar_sa: تزامن منتجات ديناميكي
es_es: Sincronización de productos manual
fa_ir: همگام سازی دستی محصولات
ru_ru: Ручная синхронизация товаров

source: Click this button to manually trigger synchronization of all mapped products. This is useful for testing or immediate updates.
ar_sa: للبدء في تزامن ديناميكي كل المنتجات غير المرتبطة، اضغط على هذا الزر. هذا مفيد للاختبار أو التحديثات الفورية.
es_es: Haz clic en este botón para iniciar la sincronización manual de todos los productos asignados. Esto es útil para pruebas o actualizaciones inmediatas.
fa_ir: برای شروع دستی همگام‌سازی همه محصولات نگاشت‌شده، روی این دکمه کلیک کنید. این برای آزمایش یا به‌روزرسانی‌های فوری مفید است.
ru_ru: Нажмите эту кнопку, чтобы вручную запустить синхронизацию всех связанных товаров. Это полезно для тестирования или немедленного обновления.

source: 📦 Order Updating Cron Job
ar_sa: 📦 مهمة مجدولة لتحديث الطلبات
es_es: 📦 Tarea programada de actualización de pedidos
fa_ir: 📦 بروزرسانی سفارشات از طریق کرون جاب
ru_ru: 📦 Крон-задача обновления заказов

source: Order Updating through Cron Job
ar_sa: تحديث الطلبات من خلال مهمة مجدولة
es_es: Actualización de pedidos a través de la tarea programada
fa_ir: بروزرسانی سفارشات از طریق کرون جاب
ru_ru: Обновление заказов через крон-задачу

source: Enable Cron Job for Order Updating (not recommended)
ar_sa: تفعيل مهمة مجدولة لتحديث الطلبات (غير موصى به)
es_es: Habilitar tarea programada para actualización de pedidos (no recomendado)
fa_ir: فعالسازی کرون جاب برای بروزرسانی سفارشات (توصیه نمیشود)
ru_ru: Включить крон-задачу для обновления заказов (не рекомендуется)

source: If your WooCommerce store is running on a real domain with HTTPS, orders are automatically updated via webhooks and you do not need to enable cron jobs. Cron jobs are only recommended for development/testing environments or when webhooks are not available.
ar_sa: إذا كان متجر WooCommerce يعمل على دامنة حقيقية مع HTTPS، يتم تحديث الطلبات تلقائياً عبر وب هوك ولا تحتاج إلى تفعيل المهام المجدولة. المهام المجدولة موصى بها فقط للبيئات التطويرية أو عندما لا يكون هناك وب هوك.
es_es: Si tu tienda WooCommerce está corriendo en un dominio real con HTTPS, los pedidos se actualizan automáticamente a través de webhooks y no necesitas habilitar las tareas programadas. Las tareas programadas solo se recomiendan para entornos de desarrollo/pruebas o cuando los webhooks no están disponibles.
fa_ir: اگر فروشگاه شما از دامنه واقعی و HTTPS استفاده میکند، سفارشات بطور خودکار بوسیله وب هوک بروزرسانی میشوند و نیاز به فعالسازی این گزینه ندارید. کرون جاب ها برای محیط تست/توسعه و یا در جایی که وب هوک های در دسترس نیستند توصیه میشوند.
ru_ru: Если ваш магазин WooCommerce работает на реальном домене с HTTPS, заказы автоматически обновляются через вебхуки, и вам не нужно включать крон-задачи. Крон-задачи рекомендуются только для разработки/тестирования или если вебхуки недоступны.

source: Update Interval
ar_sa: فاصل التحديث
es_es: Intervalo de actualización
fa_ir: دوره زمانی
ru_ru: Интервал обновления

source: How often the system should check for order updates. Recommended: Every 5 minutes for fastest updates.
ar_sa: كيف يجب أن يتحقق جهازك من تحديثات الطلبات؟ الموصى به: كل 5 دقائق لأفضل تحديثات.
es_es: ¿Con qué frecuencia debería el sistema verificar las actualizaciones de pedidos? Recomendado: cada 5 minutos para las actualizaciones más rápidas.
fa_ir: چند وقت یکبار سیستم وضعیت سفارشات را چک کند. پیشنهاد: هر 5 دقیقه برای بهره بری بالاتر.
ru_ru: Как часто система должна проверять обновления заказов. Рекомендуется: каждые 5 минут для самой быстрой актуализации.

source: Manual Update
ar_sa: تحديث ديناميكي
es_es: Actualización manual
fa_ir: بروزرسانی دستی
ru_ru: Ручное обновление

source: Click this button to manually trigger an update of all pending and processing orders. This is useful for testing or immediate updates.
ar_sa: للبدء في تحديث ديناميكي كل الطلبات المعلقة والمعالجة، اضغط على هذا الزر. هذا مفيد للاختبار أو التحديثات الفورية.
es_es: Haz clic en este botón para iniciar una actualización manual de todos los pedidos pendientes y en proceso. Esto es útil para pruebas o actualizaciones inmediatas.
fa_ir: برای به‌روزرسانی دستی تمام سفارش‌های در حال انتظار و در حال پردازش، روی این دکمه کلیک کنید. این گزینه برای آزمایش یا به‌روزرسانی‌های فوری مفید است.
ru_ru: Нажмите эту кнопку, чтобы вручную запустить обновление всех ожидающих и обрабатываемых заказов. Это полезно для тестирования или немедленного обновления.

source: 🕒 Cron Job Status
ar_sa: 🕒 حالة مهمة مجدولة
es_es: 🕒 Estado de la tarea programada
fa_ir: 🕒 وضعیت کرون جاب
ru_ru: 🕒 Статус крон-задачи

source: Product Sync Status
ar_sa: حالة التزامن المنتجات
es_es: Estado de sincronización de productos
fa_ir: وضعیت همگام سازی محصولات
ru_ru: Статус синхронизации товаров

source: Enabled:
ar_sa: مفعل:
es_es: Habilitado:
fa_ir: فعال:
ru_ru: Включено:

source: Yes
ar_sa: نعم
es_es: Sí
fa_ir: بله
ru_ru: Да

source: Next Run:
ar_sa: التنفيذ التالي:
es_es: Próxima ejecución:
fa_ir: اجرای بعدی:
ru_ru: Следующий запуск:

source: Interval:
ar_sa: الفاصل:
es_es: Intervalo:
fa_ir: بازه زمانی:
ru_ru: Интервал:

source: Product sync status information not available.
ar_sa: معلومات حالة التزامن المنتج غير متوفرة.
es_es: La información de estado de sincronización de productos no está disponible.
fa_ir: اطلاعات همگام سازی محصول در دسترس نیست.
ru_ru: Информация о статусе синхронизации товаров недоступна.

source: Order Update Status
ar_sa: حالة تحديث الطلب
es_es: Estado de actualización de pedidos
fa_ir: بروزرسانی وضعیت سفارش
ru_ru: Статус обновления заказа

source: Order update status information not available.
ar_sa: معلومات حالة تحديث الطلب غير متوفرة.
es_es: La información de estado de actualización de pedidos no está disponible.
fa_ir: اطلاعات بروزرسانی سفارش در دسترس نیست.
ru_ru: Информация о статусе обновления заказа недоступна.

source: Troubleshooting
ar_sa: تشخيص الأعطال
es_es: Solución de problemas
fa_ir: عیب یابی
ru_ru: Устранение неполадок
